using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace API.Models
{
    public class DB
    {
        public static List<Appeal> appealList = new List<Appeal>()
        {
            new Appeal(){},
            
        };
        public static List<reply> replyList = new List<reply>()
        {
            new reply(){Name="gili",Email="tuu",phone="12345678",BodyReply="rtyuio" },
            new reply(){Name="ruli",Email="aaa",phone="3456789",BodyReply="ddddd"},
            new reply(){Name="diti",Email="sss",phone="7890-0",BodyReply="tiop" },


        };
        public static List<service> servicelist = new List<service>()
        {
             new service(){Typeservice="private_home",Details="  בשעה טובה אתם עומדים להגשים חלום ולבנות בית קרקע פרטי. ככל הנראה מדובר בפרויקט המשמעותי והיקר ביותר שתעשו בחייכם כמשפחה.  בדיוק בגלל זה חשוב להיערך, לכך מראש, ולדעת שעומד בפניכם תהליך תכנון מורכב ורב שלבי.את התהליך הזה חשוב לבצע עם ליווי של אדריכל מנוסה ומומלץ כדאי להכיר מראש את השלבים של התכנון,וכן את השיקולים אשר שיכתיבו את חזות הבית, סגנון עיצובו, אופן חלוקת החלל הפנימי, גודל חדרים, חזות הגינה, מספר מפלסים ועוד."
                 ,Text="אדריכלות בתים פרטיים הינה נישה בפני עצמה בעולם האדריכלות. הרבה אנשים חושבים שכל אדריכל יכול לתכנן בתים פרטיים, כי לאותם אנשים יש תפישה מוטעית שמי שגר בתוך בית כנראה גם יודע לתכנן אותו.  אבל… אין דבר רחוק יותר מן האמת.  דווקא תכנון של בתים פרטיים דורש התמקצעות רבה, נסיון ספציפי בתחום הזה, והבנה בשלל נושאים.  בית פרטי הוא מיקרו-קוסמוס, אשר מכיל בתוכו את כל סוגי המבנים בפורמט מצומצם: מלונאות (=חדרי שינה), מפעל מזון (=מטבח), מסעדה (=פינת אוכל), משרד (=חדר העבודה הפרטי), גן אירועים (=פרגולה וחצר), ועוד ועוד…"},
             new service(){Typeservice="modern",Details=" ואיך קרה שהייתה לנו אי הבנה שכזו. הסתבר שמבחינתם בית מודרני הוא בית בסגנון המקובל כיום. לעומת זאת בעולם המושגים שלי כאדריכלית, סגנון מודרני מתאר סוגיבתים שהם אוהבים, כהשראה לעיצוב. לתדהמתי, התמונות שקיבלתי מהם היו של בתים בסגנון כפרי מובהק! אחרי שהתאוששתי קצת מההלם, בדקתי איתם מה בדיוק פספסתי,יהיה ממש מרענן לגוון קצת… כך התחלנו בגיבוש הפרוגרמה, ותכנון הסקיצות, עד שהגענו לשלב של עיצוב החזיתות. בשלב זה, ביקשתי מהזוג המקסים להעביר לי תמונות של לפני כמה שנים הגיע אלי זוג צעיר, וביקשו שאתכנן עבורם בית מודרני. באותה תקופה, רוב המשפחות רצו שאתכנן עבורם בתים כפריים, ולכן ממש שמחתי. חשבתי לעצמי שזה "
                 ,Text="אדריכלות מודרנית הינה למעשה שם כולל לכמה גישות וסגנונות אדריכליים אשר החלו בחצי הראשון של המאה הקודמת, ובעצם ממשיכים להתקיים עד ימינו. מדובר בגישה אדריכלית שהולכת יד ביד עם תפישת המודרניזם אשר התפתחה בסוף המאה התשע עשרה באירופה ובארהב. תפישות אלו תורגמו בשנות העשרים של המאה הקודמת לכדי גישות אדריכליות פרקטיות ותיאורטיות, שהייתה להן השפעה ניכרת על חזותן של הבנייה האורבאנית (=עירונית), ועל חזותן של ערים." },
 
        };
    }
 } 